[Back to Lecture Overview](Overview.ipynb)

# Database Access
* Author: Johannes Maucher
* Last Update: 12.06.2020
* References: 
    * http://jgardiner.co.uk/blog/read_sql_pandas
    * PostgreSQL Online Manual: [https://www.postgresql.org/docs/8.4/static/queries-table-expressions.html](https://www.postgresql.org/docs/8.4/static/queries-table-expressions.html).
    * SQL Queries in Pandas: http://pandas.pydata.org/pandas-docs/stable/io.html#sql-queries
    * SQLAlchemy documentation: http://docs.sqlalchemy.org/en/latest/intro.html
    * SQLAlchemy tutorial of Python Central: http://pythoncentral.io/introductory-tutorial-python-sqlalchemy/

<figure align="center">
<img width="800" src="https://maucher.home.hdm-stuttgart.de/Pics/DS_Python_Database_All.png">
</figure>

## Preliminaries
1. Download and install [PostgreSQL](https://www.postgresql.org/)
2. Verify, that pgAdmin has been installed within the PostgreSQL installation. pgAdmin is an open source administration and development platform for PostgreSQL databases. 
3. In pgAdmin create a new database as described e.g. in https://www.pgadmin.org/docs/pgadmin4/dev/modifying_tables.html.
4. Check if the Python package `psycopg2` is installed. [psycopg2](http://initd.org/psycopg/docs/index.html) is the most popular PostgreSQL database adapter for the Python programming language. For installation type 
`pip install psycopg2`
or
`conda install psycopg2`
into a shell.

In the code below, the name of the database is *dataScienceExp*. Please use your own database- and table-name, instead.

In [1]:
#!conda install -y psycopg2

In [2]:
import psycopg2 #provides drivers for PostgreSQL
import numpy as np
import json #required to access json file
import pandas as pd
from sqlalchemy import create_engine

## Connect to Database
The database-connection parameters are defined in a .json file like this [configTemplate.json](configTemplate.json). Replace the placeholders in this file by the connection-parameters of your database and import your personalized configuration file as follows:

In [3]:
with open('configLocalDS3.json') as f:
    conf = json.load(f)

In [4]:
#conf

The code above reads the contents of the .json-File into a Python dictionary.

In [5]:
print(type(conf))
print("Name of database is: ",conf['database'])
print("Name of user is: ",conf['user'])

<class 'dict'>
Name of database is:  postgres
Name of user is:  postgres

Next, the information from the `conf`-dictionary is integrated in a string-variable `conn_str`, which is passed to the `connect()`-method of `psycopg2`. This method returns a connection-object to the configured database.

In [6]:
conn_str = "host={} dbname={} user={} password={}".format(conf["host"], conf["database"], conf["user"], conf["passw"])
conn = psycopg2.connect(conn_str)
#conn = psycopg2.connect(host=awsDB,dbname="hrv_web",user=awsUser,password=awsPw)

OperationalError: could not connect to server: Connection refused
	Is the server running on host "localhost" (::1) and accepting
	TCP/IP connections on port 5432?
could not connect to server: Connection refused
	Is the server running on host "localhost" (127.0.0.1) and accepting
	TCP/IP connections on port 5432?

## Without Pandas

The standard Python way to proceed is to generate a `cursor`-object for the connection. This cursor-object can then be used to execute *SQL*-queries:

In [8]:
cur = conn.cursor()
#cur.close()

### Create new table and insert some data
The following SQL statement creates a new table, if it not already exists. The table has three columns `id`, `num` and `data`. The first column is a serial number, which acts as primary key, the second column is an integer and the third a string variable.

In [9]:
cur.execute("CREATE TABLE IF NOT EXISTS test1 (id serial PRIMARY KEY, num integer, data varchar);")

Insert some data into the table:

In [10]:
cur.execute("INSERT INTO test1 (num, data) VALUES (%s, %s)",(100, "first third entry"))

In [11]:
cur.execute("INSERT INTO test1 (num, data) VALUES (%s, %s)",(200, "second test entry"))

Load the entire table:

In [12]:
cur.execute("SELECT * FROM test1;")

The result of the SQL-query is saved to a Python list by the following command:

In [13]:
rows=cur.fetchall()

In [14]:
print(type(rows))
print(len(rows))

<class 'list'>
2

In [15]:
for a in rows:
    print(a)

(1, 100, 'first third entry')
(2, 200, 'second test entry')

In [16]:
cur.execute("SELECT * FROM test1;")

In [17]:
print(cur.fetchone())

(1, 100, 'first third entry')

In [18]:
print(cur.fetchone())

(2, 200, 'second test entry')

In [19]:
print(cur.fetchone())

None

### Update data

In [20]:
cur.execute("UPDATE test1 SET num=%s, data=%s WHERE id=1",(101, "update test entry"))

In [21]:
cur.execute("SELECT * FROM test1;")
print(cur.fetchall())

[(2, 200, 'second test entry'), (1, 101, 'update test entry')]

### Drop existing table

In [22]:
cur.execute("""DROP TABLE test1""")

### Commit

The changes to the databases will only be persistent after the following `commit`-command:

In [23]:
conn.commit()

Close the communication with the database:

In [24]:
cur.close()
conn.close()

## Using SQLAlchemy  and Pandas
The SQLAlchemy SQL Toolkit and Object Relational Mapper (ORM) is a comprehensive set of tools for working with databases and Python ([SQLAlchemy Overview](http://docs.sqlalchemy.org/en/latest/intro.html)). This [SQLAlchemy Tutorial](http://pythoncentral.io/introductory-tutorial-python-sqlalchemy/) provides a glimpse of ORM in SQLAlchemy.

In this lecture, SQLAlchemy is just used because it provides a  comfortable interface with Pandas dataframes. In particular because of its capability to write Pandas dataframe to database tables. 

For accessing a database with SQLAlchemy first an `engine`-object must be created.

In [25]:
from sqlalchemy import create_engine
conn_str ='postgresql://%s:%s@localhost:5432/%s'%(conf["user"], conf["passw"],conf["database"])
engine = create_engine(conn_str)

### Car From .csv to Pandas Dataframe to SQL-Table
The following code cells demonstrate how 
* data can be imported from a .csv-file into a Pandas dataframe
* the Pandas dataframe is written into a databasetable.
* if the table not already exists, it will be created first.

In [26]:
carsDF=pd.read_csv("../../Data/mtcars.csv",sep=",",header=0,index_col=False)

In [27]:
if not engine.has_table("cartable"):
    carsDF.to_sql(name='cartable',index=True, index_label='index',con=engine)
else:
    print("table already exists")

table already exists

The `engine`-object provides the function `connect()` for connecting to the database. This connection can be passed to the `read_sql_table(datatable,connection)`-function of Pandas, which returns a pandas dataframe containing the data of the specified databasetable.

In [28]:
with engine.connect() as conn, conn.begin():
    data = pd.read_sql_table('cartable',conn)

In [29]:
data.head()

,index,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

### SQL-Queries
SQL queries can be realized by writing the SQL statement into a string-variable and passing this string to the Pandas function `read_sql_query()`.

In [30]:
carb4=pd.read_sql_query("SELECT * FROM cartable WHERE carb >= 4 ORDER BY mpg",engine)

In [31]:
carb4

,index,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
1,15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
2,23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
3,6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
4,16,Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
5,30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
6,28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
7,10,Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
8,9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
9,29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
10,1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
11,0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4

In [32]:
cyl8=pd.read_sql_query("SELECT model,mpg,cyl,carb FROM cartable WHERE cyl = 8 ORDER BY mpg",engine)

In [33]:
cyl8

                  model   mpg  cyl  carb
0    Cadillac Fleetwood  10.4    8     4
1   Lincoln Continental  10.4    8     4
2            Camaro Z28  13.3    8     4
3            Duster 360  14.3    8     4
4     Chrysler Imperial  14.7    8     4
5         Maserati Bora  15.0    8     8
6           Merc 450SLC  15.2    8     3
7           AMC Javelin  15.2    8     2
8      Dodge Challenger  15.5    8     2
9        Ford Pantera L  15.8    8     4
10           Merc 450SE  16.4    8     3
11           Merc 450SL  17.3    8     3
12    Hornet Sportabout  18.7    8     2
13     Pontiac Firebird  19.2    8     2

### Just another example

In [34]:
insuranceDF=pd.read_csv("../../R/Lecture/data/insurance.csv",sep=",",header=0,index_col=False)

In [35]:
insuranceDF.shape

(1338, 7)

In [36]:
insuranceDF.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

Write Pandas dataframe into a new table in PostgreSQL DB.

In [37]:
if not engine.has_table("insurancetable"):
    insuranceDF.to_sql(name='insurancetable',index=True, index_label='index',con=engine)
else:
    print("table already exists")

table already exists

Check if data of the new table can be accessed:

In [38]:
with engine.connect() as conn, conn.begin():
    data = pd.read_sql_table('insurancetable',conn)

In [39]:
data.head()

   index  age     sex     bmi  children smoker     region      charges
0      0   19  female  27.900         0    yes  southwest  16884.92400
1      1   18    male  33.770         1     no  southeast   1725.55230
2      2   28    male  33.000         3     no  southeast   4449.46200
3      3   33    male  22.705         0     no  northwest  21984.47061
4      4   32    male  28.880         0     no  northwest   3866.85520

In [40]:
child3=pd.read_sql_query("SELECT * FROM insurancetable WHERE children > 3 ORDER BY children",engine)

In [41]:
child3

    index  age     sex     bmi  children smoker     region      charges
0     344   49  female  41.470         4     no  southeast  10977.20630
1     390   48    male  35.625         4     no  northeast  10736.87075
2      83   48  female  41.230         4     no  northwest  11033.66170
3     165   47    male  28.215         4     no  northeast  10407.08585
4    1012   61  female  33.330         4     no  southeast  36580.28216
5    1064   29  female  25.600         4     no  southwest   5708.86700
6      61   25    male  33.660         4     no  southeast   4504.66240
7    1094   50  female  33.700         4     no  southwest  11299.34300
8    1095   18  female  31.350         4     no  northeast   4561.18850
9     450   39    male  29.600         4     no  southwest   7512.26700
10    494   21    male  25.700         4    yes  southwest  17942.10600
11   1154   48  female  27.930         4     no  northwest  11015.17470
12    211   40    male  30.875         4     no  northwest   8162.71625
13   1247   33    male  29.400         4     no  southwest   6059.17300
14   1253   40  female  29.300         4     no  southwest  15828.82173
15    621   37    male  34.100         4    yes  southwest  40182.24600
16   1307   32    male  28.120         4    yes  northwest  21472.47880
17   1318   35    male  39.710         4     no  northeast  19496.71917
18    639   56    male  33.660         4     no  southeast  12949.15540
19    258   51    male  24.415         4     no  northwest  11520.09985
20    659   57  female  28.785         4     no  northeast  14394.39815
21    754   24    male  33.630         4     no  northeast  17128.42608
22    321   26  female  29.640         4     no  northeast  24671.66334
23    884   25    male  26.695         4     no  northwest   4877.98105
24    891   36  female  29.040         4     no  southeast   7243.81360
25    937   39  female  24.225         5     no  northwest   8965.79575
26     71   31    male  28.500         5     no  northeast   6799.45800
27    166   20  female  37.000         5     no  southwest   4830.63000
28    413   25    male  23.900         5     no  southwest   5080.09600
29    425   45    male  24.310         5     no  southeast   9788.86590
30    438   52  female  46.750         5     no  southeast  12592.53450
31    568   49  female  31.900         5     no  southwest  11552.90400
32    640   33    male  42.400         5     no  southwest   6666.24300
33    877   33    male  33.440         5     no  southeast   6653.78860
34    932   46    male  25.800         5     no  southwest  10096.97000
35     32   19  female  28.600         5     no  southwest   4687.79700
36    969   39  female  34.320         5     no  southeast   8596.82780
37    984   20    male  30.115         5     no  northeast   4915.05985
38   1085   39  female  18.300         5    yes  southwest  19023.26000
39   1116   41    male  29.640         5     no  northeast   9222.40260
40   1130   39  female  23.870         5     no  southeast   8582.30230
41   1245   28    male  24.300         5     no  southwest   5615.36900
42   1272   43    male  25.520         5     no  southeast  14478.33015